# 颜色和小面位置相互转化（字典）
color_to_facet = {"white":"U", "red":"L", "blue":"F", "green":"B", "orange":"R", "yellow":"D"}

facet_to_color = {val:key for key, val in color_to_facet.items()}


# 上，左，右，处在三个位置时各颜色的数值
colors = {'white': ((252, 244, 252), (222, 215, 222), (198, 192, 198)),
         'red': ((236, 56, 35), (208, 50, 30), (186, 44, 27)),
         'blue': ((64, 168, 198), (56, 148, 174), (51, 132, 155)),
         'green': ((128, 200, 55), (113, 176, 49), (101, 157, 44)),
         'orange': ((252, 138, 10), (222, 122, 9), (198, 109, 8)),
         'yellow': ((252, 237, 71), (222, 208, 63), (198, 186, 56))}